### Python and SQL: intro / SQL platforms - 2024 Z


### This material may not be copied or published elsewhere (including Facebook and other social media) without the  permission of the author!

# Introduction to SQL (part3)

Based on information from previous classes, we will introduce more advanced sql topics. We will consider:
   * join statments,
   * working with sets,
   * grouping and agregate functions,
   * arithmetic operators + built-in math functions,
   * subqueries,
   * indexes,
   * views,
   * triggers.
   
During this class we will use data stored in testdb2.db database.We will connect to this database using sqlite3 package and the code given below:

In [7]:
import sqlite3

#connect to testdb2.db database
conn = sqlite3.connect('testdb2.db')

#close the connection and free all resources
conn.close()

def printAll(listOfResultsA):
    for item in listOfResultsA:
        print(item)

The testdb2.db contains the following tables:
 * student
 * staff
 * specialistation
 * subject
 * student_subject
 * log 
 
**The free graphical tool SQLStudio (https://sqlitestudio.pl) can be used  to verify changes in given database.

## JOIN statments

Queries against a single table are certainly not rare, but you will find that most of your queries will require two, three, or even more tables. In the code below we wil use one out of three joins types:
* join
* inner join
* outer join

The easiest way to start is to put the student and specialisation tables into the FROM clause of a query.

In [15]:
import sqlite3

conn = sqlite3.connect('testdb2.db')

c = conn.cursor()


c.execute("Select * from student")
print("\nPresent all data in student table:")
print(c.fetchall())

c.execute("Select * from specialisation")
print("\nPresent all data in specialisation table:")
print(c.fetchall())

print("\nPresent student and chosen specialisation:")
c.execute("SELECT e.name,e.surname,d.name FROM student e join specialisation d")


#get all results,assign them to the list,fecthall() returns empty list if no results
listOfResults=c.fetchall()
for item in listOfResults:
    print(item)


# Save (commit) the changes
conn.commit()

# We close the connection and free all resources
conn.close()

Present all data in student table:
[(1, 'Tom', 'Silver', 1996, 70, 176, 1), (2, 'Alex', 'Great', 1995, 60, 164, 2), (3, 'Michael', 'Jordan', 1975, 95, 201, 1), (4, 'Ann', 'Green', 1996, 50, 168, 1), (5, 'Jack', 'Gold', 1996, 80, 190, 1), (6, 'Jack', 'Smith', 1996, 75, 175, None)]

Present all data in specialisation table:
[(1, 'QF'), (2, 'Finance&Accounting')]

Present student and chosen specialisation:
('Tom', 'Silver', 'QF')
('Tom', 'Silver', 'Finance&Accounting')
('Alex', 'Great', 'QF')
('Alex', 'Great', 'Finance&Accounting')
('Michael', 'Jordan', 'QF')
('Michael', 'Jordan', 'Finance&Accounting')
('Ann', 'Green', 'QF')
('Ann', 'Green', 'Finance&Accounting')
('Jack', 'Gold', 'QF')
('Jack', 'Gold', 'Finance&Accounting')
('Jack', 'Smith', 'QF')
('Jack', 'Smith', 'Finance&Accounting')

The code above returns 12 rows. However, we have only 5 students,who have made decision about their specialisation.  The reason of such result is one: the query didn’t specify how the two tables should be joined, the database server generated the Cartesian product, which is every permutation of the two tables.

### INNER JOIN

If we want to obtain only 5 expected rows, then we should modify our query and use inner join statment. We need to describe, how the two tables are related. Earlier, we showed that the student.spec_id column serves as the link between the two tables,
so this information needs to be added to the ON subclause of the FROM clause.

#### Two tables

In [17]:
def printAll(listOfResults):
    for item in listOfResults:
        print(item)

import sqlite3

conn = sqlite3.connect('testdb2.db')

c = conn.cursor()

c.execute("Select * from student")
print("\nPresent all data in student table:")
printAll(c.fetchall())

c.execute("Select * from specialisation")
print("\nPresent all data in specialisation table:")
printAll(c.fetchall())

print("\n inner join results below.Output table (name,surname,specialisation):")
c.execute("SELECT e.name,e.surname,d.name FROM student e inner join specialisation d on e.spec_id=d.spec_id")


#get all results,assign them to the list,fecthall() returns empty list if no results
listOfResults=c.fetchall()
printAll(listOfResults)


# save (commit) the changes
conn.commit()

# we close the connection and free all resources
conn.close()

Present all data in student table:
(1, 'Tom', 'Silver', 1996, 70, 176, 1)
(2, 'Alex', 'Great', 1995, 60, 164, 2)
(3, 'Michael', 'Jordan', 1975, 95, 201, 1)
(4, 'Ann', 'Green', 1996, 50, 168, 1)
(5, 'Jack', 'Gold', 1996, 80, 190, 1)
(6, 'Jack', 'Smith', 1996, 75, 175, None)

Present all data in specialisation table:
(1, 'QF')
(2, 'Finance&Accounting')

 inner join results below.Output table (name,surname,specialisation):
('Tom', 'Silver', 'QF')
('Alex', 'Great', 'Finance&Accounting')
('Michael', 'Jordan', 'QF')
('Ann', 'Green', 'QF')
('Jack', 'Gold', 'QF')

If a value exists for the spec_id column in one table but not the other, then the join fails for the rows containing that value and those rows are excluded from the result set.Printed results confirm previous statment while we do not the row which contains None value in spec_id column.

*If we do not specify the type of join, then the server will use an inner join by default.

Below we present, how we can join data from more than two tables.

#### Three tables

In [4]:

import sqlite3

conn = sqlite3.connect('testdb2.db')

c = conn.cursor()

c.execute("Select * from student")
print("\nPresent all data in student table:")
printAll(c.fetchall())

c.execute("Select * from student_subject")
print("\nPresent all data in student_subject table:")
printAll(c.fetchall())

c.execute("Select * from subject")
print("\nPresent all data in subject table. Output table (id,student_id,subject_id,grade):")
printAll(c.fetchall())

print("\nPrint inner join results for three tables. Output table (name,surname,subject,grade) :")
c.execute("SELECT e.name,e.surname,s.name,d.grade FROM student e inner join student_subject d on e.student_id=d.student_id \
          inner join subject s on d.subject_id=s.subject_id")


#get all results,assign them to the list,fecthall() returns empty list if no results
listOfResults=c.fetchall()
printAll(listOfResults)


# save (commit) the changes
conn.commit()

# close the connection and free all resources
conn.close()

Present all data in student table:
(1, 'Tom', 'Silver', 1996, 70, 176, 1)
(2, 'Alex', 'Great', 1995, 60, 164, 2)
(3, 'Michael', 'Jordan', 1975, 95, 201, 1)
(4, 'Ann', 'Green', 1996, 50, 168, 1)
(5, 'Jack', 'Gold', 1996, 80, 190, 1)
(6, 'Jack', 'Smith', 1996, 75, 175, None)

Present all data in student_subject table:
(1, 1, 1, 5)
(2, 2, 1, 4)
(3, 3, 1, 3)
(4, 4, 1, 4)

Present all data in subject table. Output table (id,student_id,subject_id,grade):
(1, 'Python&SQL Intro')
(2, 'Advanced Macroeconomics')

Print inner join results for three tables. Output table (name,surname,subject,grade) :
('Tom', 'Silver', 'Python&SQL Intro', 5)
('Alex', 'Great', 'Python&SQL Intro', 4)
('Michael', 'Jordan', 'Python&SQL Intro', 3)
('Ann', 'Green', 'Python&SQL Intro', 4)

## OUTER JOIN

Let's assume that, we want to obtain the list of students and their specialistation (also the cases when specialisation was not chosen). The inner join conditions will fail to find matches for all the rows in the students table,while some students did not make decision about their specialistion. This time the correct resul can be obtained withe outer join.

#### Left outer join

The keyword left indicates that the table on the left side of the join is responsible for determining the number of rows in the result set, whereas the table on the right side is used to provide column values whenever a match is found.

In [5]:

import sqlite3

conn = sqlite3.connect('testdb2.db')

c = conn.cursor()

c.execute("Select * from student")
print("\nPresent all data in student table:")
printAll(c.fetchall())

c.execute("Select * from specialisation")
print("\nPresent all data in specialisation table:")
printAll(c.fetchall())

print("\n left outer join results below:")
c.execute("SELECT e.name,e.surname,d.name FROM student e left outer join specialisation d on e.spec_id=d.spec_id")


#get all results,assign them to the list,fecthall() returns empty list if no results
printAll(c.fetchall())


print("\n right outer join results below:")
c.execute("SELECT e.name,e.surname,d.name FROM student e right outer join specialisation d on e.spec_id=d.spec_id")


#get all results,assign them to the list,fecthall() returns empty list if no results
printAll(c.fetchall())

#save (commit) the changes
conn.commit()

#close the connection and free all resources
conn.close()

Present all data in student table:
(1, 'Tom', 'Silver', 1996, 70, 176, 1)
(2, 'Alex', 'Great', 1995, 60, 164, 2)
(3, 'Michael', 'Jordan', 1975, 95, 201, 1)
(4, 'Ann', 'Green', 1996, 50, 168, 1)
(5, 'Jack', 'Gold', 1996, 80, 190, 1)
(6, 'Jack', 'Smith', 1996, 75, 175, None)

Present all data in specialisation table:
(1, 'QF')
(2, 'Finance&Accounting')

 left outer join results below:
('Tom', 'Silver', 'QF')
('Alex', 'Great', 'Finance&Accounting')
('Michael', 'Jordan', 'QF')
('Ann', 'Green', 'QF')
('Jack', 'Gold', 'QF')
('Jack', 'Smith', None)

 right outer join results below:

OperationalError: RIGHT and FULL OUTER JOINs are not currently supported

*Right outer join is not supported in SQLite. However, the other database systems (MySQL,Oracle) allow us to use it. The expected result is the output table in which number of rows is equal to the number of rows in specialisation table

## Working with sets

### UNION and UNION ALL statment

The SQLite UNION/UNION ALL operator is used to combine the result sets of 2 or more SELECT statements.
Each SELECT statement within the UNION operator must have the same number of fields in the result sets with similar data type.
Remeber,UNION statment sorts results and removes duplicates from the output set!

<img src="union.png">

### EXCEPT statment

The EXCEPT operator will retrieve all records from the first dataset and then remove from the results all records from the second dataset.Each SELECT statement within the EXCEPT query must have the same number of fields in the result sets with similar data types
<img src="except.png">

### INTERSECT statment

The INTERSECT operator returns the intersection of 2 or more datasets. Each dataset is defined by a SELECT statement. If the record exists in both data set, then it will be included in the results.

<img src="intersect.png">

In [12]:
def printAll(listOfResultsA):
    for item in listOfResultsA:
        print(item)
    

import sqlite3

conn = sqlite3.connect('testdb2.db')

c = conn.cursor()

c.execute("Select * from student")
print("\nPresent all data in student table:")
printAll(c.fetchall())

c.execute("Select * from staff")
print("\nPresent all data in staff table:")
printAll(c.fetchall())

#UNION
print("\nunion results below:(results are unique and ordered)")
c.execute("SELECT e.student_id,e.name,e.surname FROM student e union SELECT s.staff_id,s.name,s.surname FROM staff s")


#get all results,assign them to the list,fecthall() returns empty list if no results
printAll(c.fetchall())

#UNION ALL
print("\nunion all results below: (results contain duplicates and results are not ordered)")
c.execute("SELECT e.student_id,e.name,e.surname FROM student e union all SELECT s.staff_id,s.name,s.surname FROM staff s")


#get all results,assign them to the list,fecthall() returns empty list if no results
printAll(c.fetchall())


#EXCEPT

print("\nexcept statment results below:")
c.execute("SELECT e.student_id,e.name,e.surname FROM student e except SELECT s.staff_id,s.name,s.surname FROM staff s")


#get all results,assign them to the list,fecthall() returns empty list if no results
printAll(c.fetchall())


#INTERSECT
print("\nintersect statment results below:")
c.execute("SELECT e.student_id,e.name,e.surname FROM student e intersect SELECT s.staff_id,s.name,s.surname FROM staff s")


#get all results,assign them to the list,fecthall() returns empty list if no results
printAll(c.fetchall())

# Save (commit) the changes
conn.commit()

# We close the connection and free all resources
conn.close()

Present all data in student table:
(1, 'Tom', 'Silver', 1996, 70, 176, 1)
(2, 'Alex', 'Great', 1995, 60, 164, 2)
(3, 'Michael', 'Jordan', 1975, 95, 201, 1)
(4, 'Ann', 'Green', 1996, 50, 168, 1)
(5, 'Jack', 'Gold', 1996, 80, 190, 1)
(6, 'Jack', 'Smith', 1996, 75, 175, None)

Present all data in staff table:
(1, 'Alfred', 'Brown', 1969)
(2, 'Tom', 'White', 1954)
(3, 'Michael', 'Jordan', 1975)

union results below:(results are unique and ordered)
(1, 'Alfred', 'Brown')
(1, 'Tom', 'Silver')
(2, 'Alex', 'Great')
(2, 'Tom', 'White')
(3, 'Michael', 'Jordan')
(4, 'Ann', 'Green')
(5, 'Jack', 'Gold')
(6, 'Jack', 'Smith')

union all results below: (results contain duplicates and results are not ordered)
(1, 'Tom', 'Silver')
(2, 'Alex', 'Great')
(3, 'Michael', 'Jordan')
(4, 'Ann', 'Green')
(5, 'Jack', 'Gold')
(6, 'Jack', 'Smith')
(1, 'Alfred', 'Brown')
(2, 'Tom', 'White')
(3, 'Michael', 'Jordan')

except statment results below:
(1, 'Tom', 'Silver')
(2, 'Alex', 'Great')
(4, 'Ann', 'Green')
(5, 'Jack', 'Gold')
(6, 'Jack', 'Smith')

intersect statment results below:
(3, 'Michael', 'Jordan')

### Grouping and agregate functions

The other important feature of SQLite is the trends analysis. Let's say, that we need to know how many students were born during each year. We use GROUP BY and COUNT(*) statments for that task. The GROUP BY statment divides the data basing on info stored in selected column (here column name is birth) or columns,while COUNT(*) calculates number of rows in each group.

#### GROUP BY

In [5]:
def printAll(listOfResultsA):
    for item in listOfResultsA:
        print(item)
    

import sqlite3

conn = sqlite3.connect('testdb2.db')

c = conn.cursor()

c.execute("Select * from student")
print("\nPresent all data in student table:")
printAll(c.fetchall())

#GROUP BY
print("\nStudent table records grouped by year of birth. Output (birth,count):")
c.execute("SELECT e.birth,COUNT(*) FROM student e GROUP BY e.birth ")


#get all results,assign them to the list,fecthall() returns empty list if no results
printAll(c.fetchall())


# Save (commit) the changes
conn.commit()

# We close the connection and free all resources
conn.close()

Present all data in student table:
(1, 'Tom', 'Silver', 1996, 70, 176, 1)
(2, 'Alex', 'Great', 1995, 60, 164, 2)
(3, 'Michael', 'Jordan', 1975, 95, 201, 1)
(4, 'Ann', 'Green', 1996, 50, 168, 1)
(5, 'Jack', 'Gold', 1996, 80, 190, 1)
(6, 'Jack', 'Smith', 1996, 75, 175, None)

Student table records grouped by year of birth. Output (birth,count):
(1975, 1)
(1995, 1)
(1996, 4)

#### Agregate functions

Aggregate functions perform a specific operation over all rows in a group. Although
every database server has its own set of specialty aggregate functions, the common
aggregate functions implemented by all major servers include:
    
    * Max() Returns the maximum value within a set
    * Min() Returns the minimum value within a set
    * Avg() Returns the average value across a set
    * Sum() Returns the sum of the values across a set
    * Count() Returns the number of values in a set

In [6]:

import sqlite3

conn = sqlite3.connect('testdb2.db')

c = conn.cursor()

c.execute("Select * from student")
print("\nPresent all data in student table:")
printAll(c.fetchall())

#GROUP BY+agregate functions
print("\n basic statistics for student table records grouped by year of birth.  Output( max_weight,min_weight,avg_weight,count):")
c.execute("SELECT e.birth,MAX(e.weight),MIN(e.weight),AVG(e.weight),COUNT(*) FROM student e GROUP BY e.birth ")


#get all results,assign them to the list,fecthall() returns empty list if no results
printAll(c.fetchall())


# Save (commit) the changes
conn.commit()

# We close the connection and free all resources
conn.close()

Present all data in student table:
(1, 'Tom', 'Silver', 1996, 70, 176, 1)
(2, 'Alex', 'Great', 1995, 60, 164, 2)
(3, 'Michael', 'Jordan', 1975, 95, 201, 1)
(4, 'Ann', 'Green', 1996, 50, 168, 1)
(5, 'Jack', 'Gold', 1996, 80, 190, 1)
(6, 'Jack', 'Smith', 1996, 75, 175, None)

 basic statistics for student table records grouped by year of birth.  Output( max_weight,min_weight,avg_weight,count):
(1975, 95, 95, 95.0, 1)
(1995, 60, 60, 60.0, 1)
(1996, 80, 50, 68.75, 4)

### Arithmetic operators + built-in math functions

In SQLite, we can use standard arithmetic operators (+,-,*/) and many built-in math functions which we cane use to operate on 
values stored in columns:
    * Acos(x) Calculates the arc cosine of x
    * Asin(x) Calculates the arc sine of x
    * Atan(x) Calculates the arc tangent of x
    * Cos(x) Calculates the cosine of x
    * Cot(x) Calculates the cotangent of x
    * Exp(x) Calculates ex
    * Abs(x) Calculates absolute value of x
    * Ln(x) Calculates the natural log of x
    * Sin(x) Calculates the sine of x
    * Sqrt(x) Calculates the square root of x
    * Tan(x) Calculates the tangent of x

*Remember,when we divide one integer value by second integer value the result is closest integer value.
If we want to obtain correct results we should use CAST() function and covert values to float. Precision of printed results can be set with ROUND(arg1,arg2) function, where arg2 points number of decimal places in the ouput.

We calculate BMI values for each student in the example below:

In [7]:
import sqlite3

conn = sqlite3.connect('testdb2.db')

c = conn.cursor()

c.execute("Select * from student")
print("\nPresent all data in student table:")
printAll(c.fetchall())

#calculate BMI values
print("\nBMI results for each student:")
c.execute("SELECT e.student_id,e.name,e.surname,e.weight,e.height, \
          CAST(e.weight as FLOAT)/(CAST(e.height as float)/100 *CAST(e.height as float)/100), \
          ROUND(CAST(e.weight as FLOAT)/(CAST(e.height as float)/100 *CAST(e.height as float)/100),2) \
          FROM student e")


#get all results,assign them to the list,fecthall() returns empty list if no results
printAll(c.fetchall())


# Save (commit) the changes
conn.commit()

# We close the connection and free all resources
conn.close()

Present all data in student table:
(1, 'Tom', 'Silver', 1996, 70, 176, 1)
(2, 'Alex', 'Great', 1995, 60, 164, 2)
(3, 'Michael', 'Jordan', 1975, 95, 201, 1)
(4, 'Ann', 'Green', 1996, 50, 168, 1)
(5, 'Jack', 'Gold', 1996, 80, 190, 1)
(6, 'Jack', 'Smith', 1996, 75, 175, None)

BMI results for each student:
(1, 'Tom', 'Silver', 70, 176, 22.59814049586777, 22.6)
(2, 'Alex', 'Great', 60, 164, 22.3081499107674, 22.31)
(3, 'Michael', 'Jordan', 95, 201, 23.514269448776027, 23.51)
(4, 'Ann', 'Green', 50, 168, 17.715419501133788, 17.72)
(5, 'Jack', 'Gold', 80, 190, 22.1606648199446, 22.16)
(6, 'Jack', 'Smith', 75, 175, 24.489795918367346, 24.49)

### Subqueries

A subquery is a query contained within another SQL statement. A subquery is always enclosed within parentheses and returns result set which can consist of:
 * A single row with a single column (example below)
 * Multiple rows with a single column (example below)
 * Multiple rows and columns
 
 Remeber,when subquery returns many rows then in WHERE statment we should use IN or NOT IN operator.

In [8]:
def printAll(listOfResultsA):
    for item in listOfResultsA:
        print(item)
    

import sqlite3

conn = sqlite3.connect('testdb2.db')

c = conn.cursor()

c.execute("Select * from student")
print("\nPresent all data in student table:")
printAll(c.fetchall())

c.execute("Select * from student_subject")
print("\nPresent all data in student_subject table:")
printAll(c.fetchall())

#return the name and surname of the student, who got 5,
#subquery returns single row and single column
print("\nname and surname of the student who got 5:")
c.execute("SELECT e.student_id,e.name,e.surname \
          FROM student e where e.student_id=\
          (SELECT s.student_id from student_subject s where s.grade=5)")

#get all results,assign them to the list,fecthall() returns empty list if no results
printAll(c.fetchall())


#return the name and surname of the students, who got 4,
#subquery returns multiple rows and single column
print("\nnames and surnames of the students who got 4:")
c.execute("SELECT e.student_id,e.name,e.surname \
          FROM student e where e.student_id IN \
          (SELECT s.student_id from student_subject s where s.grade=4)")

#get all results,assign them to the list,fecthall() returns empty list if no results
printAll(c.fetchall())


# Save (commit) the changes
conn.commit()

# We close the connection and free all resources
conn.close()

Present all data in student table:
(1, 'Tom', 'Silver', 1996, 70, 176, 1)
(2, 'Alex', 'Great', 1995, 60, 164, 2)
(3, 'Michael', 'Jordan', 1975, 95, 201, 1)
(4, 'Ann', 'Green', 1996, 50, 168, 1)
(5, 'Jack', 'Gold', 1996, 80, 190, 1)
(6, 'Jack', 'Smith', 1996, 75, 175, None)

Present all data in student_subject table:
(1, 1, 1, 5)
(2, 2, 1, 4)
(3, 3, 1, 3)
(4, 4, 1, 4)

name and surname of the student who got 5:
(1, 'Tom', 'Silver')

names and surnames of the students who got 4:
(2, 'Alex', 'Great')
(4, 'Ann', 'Green')

### INDEXES

When we execute INSERT statment,the database server does not  put new record in any particular location within the table. Server places the data in the next free location within the file. When you query the student table for students whose name starts with 'J', the server will need to analyse every row of the table. 

You can decide to add an extra index to student table to speed up any queries that specify student name.
If exists more than one index on a table,the optimizer decides which index will be the most beneficial for a particular SQL
statement.

#### CREATE INDEX
We create new index using CREATE INDEX statment. If you create an index that consists of one column, SQLite uses that column as the sort key. In case you create an index that has multiple columns, SQLite uses the additional columns as the second, third, … sort keys.

In [14]:
import sqlite3

conn = sqlite3.connect('testdb2.db')

c = conn.cursor()

#add extra index on one column 
print("\nwe add extra index on column 'name' in student table")
c.execute("CREATE INDEX idx_student_name ON student (name)")

#get all results,assign them to the list,fecthall() returns empty list if no results
printAll(c.fetchall())

#add extra index on two columns 
print("\nwe add extra index on two columns: 'weight' and 'height' in student table")
c.execute("CREATE INDEX idx_student_weight_height ON student (weight,height)")

#get all results,assign them to the list,fecthall() returns empty list if no results
printAll(c.fetchall())

# Save (commit) the changes
conn.commit()

# We close the connection and free all resources
conn.close()

we add extra index on column 'name' in student table

we add extra index on two columns: 'weight' and 'height' in student table

The code below, returns all the students, whose name starts with 'J':

In [15]:
def printAll(listOfResultsA):
    for item in listOfResultsA:
        print(item)
    

import sqlite3

conn = sqlite3.connect('testdb2.db')

c = conn.cursor()

c.execute("Select * from student")
print("\nPresent all data in student table:")
printAll(c.fetchall())

#return students whose name starts with J'
print("\nstudents whose name starts with 'J':")
c.execute("SELECT e.student_id,e.name,e.surname from student e where e.name LIKE 'J%'")

#get all results,assign them to the list,fecthall() returns empty list if no results
printAll(c.fetchall())


#save (commit) the changes
conn.commit()

#close the connection and free all resources
conn.close()

Present all data in student table:
(1, 'Tom', 'Silver', 1996, 70, 176, 1)
(2, 'Alex', 'Great', 1995, 60, 164, 2)
(3, 'Michael', 'Jordan', 1975, 95, 201, 1)
(4, 'Ann', 'Green', 1996, 50, 168, 1)
(5, 'Jack', 'Gold', 1996, 80, 190, 1)
(6, 'Jack', 'Smith', 1996, 75, 175, None)

students whose name starts with 'J':
(5, 'Jack', 'Gold')
(6, 'Jack', 'Smith')

#### DROP INDEX

In [17]:
import sqlite3

conn = sqlite3.connect('testdb2.db')

c = conn.cursor()


#delete index,
print("\nwe delete  idx_student_name index")
c.execute("DROP INDEX idx_student_name ")

#get all results,assign them to the list,fecthall() returns empty list if no results
printAll(c.fetchall())

print("\nwe delete  idx_student_weight_height")
c.execute("DROP INDEX idx_student_weight_height")

#get all results,assign them to the list,fecthall() returns empty list if no results
printAll(c.fetchall())

#save (commit) the changes
conn.commit()

#close the connection and free all resources
conn.close()

we delete  idx_student_name index

OperationalError: no such index: idx_student_name

### Views

Views can be treated as a querying data mechanism. The good side of the views is that the views do not fill up free disk space. Once the view is created we use it like a virtual table,so we can:
    * select data
    * join view with the other tables
    * sometimes modify data though the view (MySQL,Oracle,SQL Server)
    
Why we use views?:
    * to structure data in a way that users or classes of users find natural or intuitive,

    * to restrict access to the data such that a user can only see limited data instead of a complete table,

    * to summarize data from various tables, which can be used to generate reports.

#### CREATE VIEW

In [18]:
def printAll(listOfResultsA):
    for item in listOfResultsA:
        print(item)
    

import sqlite3

conn = sqlite3.connect('testdb2.db')

c = conn.cursor()

c.execute("Select * from student")
print("\nPresent all data in student table:")
printAll(c.fetchall())

#create new view
print("\nCreate new view v_allData, which contains only students who made decision about their specialisation")
c.execute("CREATE VIEW v_allData AS SELECT e.name,e.surname,d.name FROM student e inner join specialisation d on e.spec_id=d.spec_id")
#get all results,assign them to the list,fecthall() returns empty list if no results
printAll(c.fetchall())

#read data from new view
print("\nPresent all data in view v_allData")
c.execute("select* from v_allData")
#get all results,assign them to the list,fecthall() returns empty list if no results
printAll(c.fetchall())

#save (commit) the changes
conn.commit()

# We close the connection and free all resources
conn.close()

Present all data in student table:
(1, 'Tom', 'Silver', 1996, 70, 176, 1)
(2, 'Alex', 'Great', 1995, 60, 164, 2)
(3, 'Michael', 'Jordan', 1975, 95, 201, 1)
(4, 'Ann', 'Green', 1996, 50, 168, 1)
(5, 'Jack', 'Gold', 1996, 80, 190, 1)
(6, 'Jack', 'Smith', 1996, 75, 175, None)

Create new view v_allData, which contains only students who made decision about their specialisation

Present all data in view v_allData
('Tom', 'Silver', 'QF')
('Alex', 'Great', 'Finance&Accounting')
('Michael', 'Jordan', 'QF')
('Ann', 'Green', 'QF')
('Jack', 'Gold', 'QF')

#### DROP VIEW

We delete view from the database using DROP VIEW statment:

In [19]:
def printAll(listOfResultsA):
    for item in listOfResultsA:
        print(item)

import sqlite3

    
conn = sqlite3.connect('testdb2.db')

c = conn.cursor()

#read data from new view
print("\nDelete view v_allData")
c.execute("DROP VIEW v_allData")
#get all results,assign them to the list,fecthall() returns empty list if no results
printAll(c.fetchall())

# Save (commit) the changes
conn.commit()

# We close the connection and free all resources
conn.close()

Delete view v_allData

### TRIGGERS

An SQLite trigger is a named database object that is executed automatically when an INSERT, UPDATE, or DELETE statement is issued against the associated table.

Most often we use triggers when we want to log some important changes in database:money withdraw, password change.

Trigger can be fired in 9 cases:

    * BEFORE INSERT
    * AFTER INSERT
    * BEFORE UPDATE
    * AFTER UPDATE
    * BEFORE DELETE
    * AFTER DELETE
    * INSTEAD OF INSERT
    * INSTEAD OF DELETE
    * INSTEAD OF UPDATE



##### CREATE TRIGGER

We create new trigger using CREATE TRIGGER statment. Below,we present example of trigger, which logs info about deleted student into log table.

In [20]:
def presentData(c):
    
    #present data in student table
    print("\nPresent data in student table")
    c.execute("Select * from student")

    #get all results,assign them to the list,fecthall() returns empty list if no results
    printAll(c.fetchall())

    #present data in log table
    print("\nPresent data in log table")
    c.execute("Select * from log")
    
    #get all results,assign them to the list,fecthall() returns empty list if no results
    printAll(c.fetchall())

        
import sqlite3

conn = sqlite3.connect('testdb2.db')

c = conn.cursor()

#insert new student Denis Rodman
print("Insert new student Denis Rodman into student table\n")
c.execute("Insert into student values(?,?,?,?,?,?,?)",(None,'Denis','Rodman',1969,95,210,None))

#get all results,assign them to the list,fecthall() returns empty list if no results
printAll(c.fetchall())

presentData(c)

#get all results,assign them to the list,fecthall() returns empty list if no results
printAll(c.fetchall())

#create trigger LogTrigger
print("Create trigger\n")
c.execute("Create trigger LogTrigger after delete on student \
    BEGIN insert into log values(old.student_id,old.name,old.surname,DATETIME('NOW')); END;")

#get all results,assign them to the list,fecthall() returns empty list if no results
printAll(c.fetchall())

#delete student Denis Rodman
print("Delete student Denis Rodman from student table\n")
c.execute("Delete from student where name='Denis' ")

presentData(c)

print("\nDrop trigger LogTrigger\n")
c.execute("DROP TRIGGER IF EXISTS LogTrigger;")

# Save (commit) the changes
conn.commit()


# We close the connection and free all resources
conn.close()

Insert new student Denis Rodman into student table


Present data in student table
(1, 'Tom', 'Silver', 1996, 70, 176, 1)
(2, 'Alex', 'Great', 1995, 60, 164, 2)
(3, 'Michael', 'Jordan', 1975, 95, 201, 1)
(4, 'Ann', 'Green', 1996, 50, 168, 1)
(5, 'Jack', 'Gold', 1996, 80, 190, 1)
(6, 'Jack', 'Smith', 1996, 75, 175, None)
(18, 'Denis', 'Rodman', 1969, 95, 210, None)

Present data in log table
(7, 'Denis', 'Rodman', '2018-01-11 15:16:27')
(8, 'Denis', 'Rodman', '2018-01-11 15:17:51')
(9, 'Denis', 'Rodman', '2018-01-11 15:18:22')
(10, 'Denis', 'Rodman', '2018-01-11 15:19:02')
(11, 'Denis', 'Rodman', '2018-01-11 15:19:38')
(12, 'Denis', 'Rodman', '2018-01-11 19:57:21')
(13, 'Denis', 'Rodman', '2018-01-11 19:57:38')
(14, 'Denis', 'Rodman', '2018-01-11 20:16:13')
(15, 'Denis', 'Rodman', '2018-01-11 20:18:24')
(16, 'Denis', 'Rodman', '2021-12-08 17:06:39')
(17, 'Denis', 'Rodman', '2021-12-09 15:04:02')
Create trigger

Delete student Denis Rodman from student table


Present data in student table
(1, 'Tom', 'Silver', 1996, 70, 176, 1)
(2, 'Alex', 'Great', 1995, 60, 164, 2)
(3, 'Michael', 'Jordan', 1975, 95, 201, 1)
(4, 'Ann', 'Green', 1996, 50, 168, 1)
(5, 'Jack', 'Gold', 1996, 80, 190, 1)
(6, 'Jack', 'Smith', 1996, 75, 175, None)

Present data in log table
(7, 'Denis', 'Rodman', '2018-01-11 15:16:27')
(8, 'Denis', 'Rodman', '2018-01-11 15:17:51')
(9, 'Denis', 'Rodman', '2018-01-11 15:18:22')
(10, 'Denis', 'Rodman', '2018-01-11 15:19:02')
(11, 'Denis', 'Rodman', '2018-01-11 15:19:38')
(12, 'Denis', 'Rodman', '2018-01-11 19:57:21')
(13, 'Denis', 'Rodman', '2018-01-11 19:57:38')
(14, 'Denis', 'Rodman', '2018-01-11 20:16:13')
(15, 'Denis', 'Rodman', '2018-01-11 20:18:24')
(16, 'Denis', 'Rodman', '2021-12-08 17:06:39')
(17, 'Denis', 'Rodman', '2021-12-09 15:04:02')
(18, 'Denis', 'Rodman', '2021-12-09 16:50:05')

Drop trigger LogTrigger

##### Remarks for CREATE TRIGGER statment:

   * we get access to the row, which is inserted, deleted,updated using the OLD and NEW references in the form: OLD.column_name and NEW.column_name
   * we use ; after INSERT and END in CREATE TRIGGER statment.

#### DROP TRIGGER

We use DROP TRIGGER statment to delete trigger. When database does not contain trigger which will be removed,  we can use IF EXISTS statment to omit warnings.

In [16]:
        
import sqlite3

conn = sqlite3.connect('testdb2.db')

c = conn.cursor()

print("\nDrop trigger LogTrigger\n")
c.execute("DROP TRIGGER IF EXISTS LogTrigger;")

# Save (commit) the changes
conn.commit()

# We close the connection and free all resources
conn.close()

Drop trigger LogTrigger